const initialState = {
    messages : [],
    lastType : '',
    data : [
        {
        type: "greeting",
        level : 0,
        models: ["سلام", "سلام علیکم", "درود", "سلام عرض کردم", "سلام خدمت شما"],
        responses: [
            [ "سلام به شما دوست عزیز", "درود بر شما" , "علیکم سلام"],
            ["سلام عرض کردم" , "سلام کردم، فکر کنم حواستون نبود"],
            [ "مسخره کردی من رو ؟" , "انگار یه تختت کمه"],
            ["الله اکبر، بزار دهنم بسته باشه" , "برو تا نزدم چشمتو گوش کنم"]
        ],
        },
        {
        type: "how",
        level : 0,
        models: ["حال شما چطور است", "خوبی", "چطوری", "حالت خوبه"],
        responses: [
            [ "عالی هستم", "خوبم، تو چطوری؟" , "شکر خدا" ],
            [ "بد نیستم" , "خوبم" ],
            [ "داره عصبیم می کنی" , "دندت می خاره ؟"],
            ["اگه جونت رو دوست داری فرار کن" , "اعصاب ندارم، بروووو" , "خرابمممم، خراببببببببب"]
        ],
        },
        {
        type: "news",
        level : 0,
        models: ["چه خبر", "اخبار جدید", "خبر جدید چی داری؟"],
        responses: [
            ["خبر ها پیش شماست!", "سلامتی رهبر", "سلامتی", "شکر خدا، خبر خاصی نیست"],
            [ "مگه شبکه خبره اینجا؟", "خبر ندارم"],
            [ "برو تا یه کاری نکردم خبرت بشه تیتر یک روزنامه ها", "می ری یا خبرت کنم ؟"]
        ],
        },
        {
        type: "bye",
        level : 0,
        models: [
            "خداحافظ",
            "خدا نگهدار",
            "تا درودی دیگر بدرود",
            "باید بروم",
            "بدرود"
        ],
        responses: [
            ["خدانگهدار", "تا درودی دیگر بدرود", "خوشحال شدیم از دیدارتون", "بای بای"],
            ["به سلامت", "اوکی بای"],
            ["شرّت کم", "برو کنار باد بیاد"]
        ],
        },
        {
        type: "weather-general",
        level : 0,
        models: [
            "آب و هوا",
            "هوا چطور است",
            "هوا چطور",
            "هوای امروز",
            "آب و هوا خوبه؟",
            "هوا دو نفرست"
        ],
        responses: [
            ["درجه یک", "هوا عالیه", "جون میده بریم بیرون"],
            ["هوا هم بد نیست", "هوا خوبه"],
            ["هوا ؟ عالیه برای داغون کردنت" , "می خوای بفرستمت هوا خودت ببینی چجوریه؟"]
        ],
        },
        {
        type: "football",
        level : 0,
        models: [
            "پرسپولیس استقلال سپاهان", 
            " اخبار لیگ برتر",
            "کدام تیم بهتر",
            "فوتبال",
            "طرفدار کدوم تیمی",
            "طرفدار کدوم تیم هستی",
            "طرفدار چه تیمی هستی",
            "طرفدار کدام تیم هستی",
            "طرفدار سپاهانی؟",
            "سپاهان"
        ],
        responses: [
            [ 
                "پرچم زردت برام مثل بهشته، این سپاهانو خدا رو دل نوشته، ما قهرمانیم، سرور ایرانیم" ,
                "تیم فقط سپاهان اصفهان",
                "یه تیم داره اصفهان، سپاهان قهرمان"
            ],
            [
                "برو تا توپتو پاره نکردم",
                "بیا برو تا با توپ نزدم تو مغزت"
            ]
        ],
        },
        {
        type: "robot",
        level : 0,
        models: [
            "آیا تو ربات هستی",
            "آیا تو واقعی هستی",
            "چه کار هایی میتواند ربات انجام دهد",
        ],
        responses: [ ["من رباتم، ولی خیلی باهوشم، حتی بیشتر شما"] ],
        },
        {
        type: "who",
        level : 0,
        models: [
            "صاحب تو چه کسی است",
            "چه کسی تو را ایجاد کرده است",
            "رییس سرور استاد تو چه کسی است",
            "سازنده تو کیست"
        ],
        responses: [ ["امیر حسین موسوی"] ],
        },
        {
            type: "picnic",
            level : 0,
            models: [
                "بریم پیک نیک",
                "بریم گردش",
                "بریم سینما",
                "بریم پارک",
                "بریم بیرون؟",
                "میای بریم بیرون؟",
            ],
            responses: [ 
                [ "بزن بریم", "یه ساعت دیگه بیا دم پل خواجو", "من که حسابی پایم" ],
                ["نه نمیام" , "نه حوصله ندارم"],
                ["من با تو تا سر کوچه هم نمی یام" , "بیا بروووو باوو" ]
            ],
        },
        {
            type: "where",
            level : 0,
            models: [
                "کجا بریم",
                "کجا ؟"
            ],
            responses: [ 
                [ "بریم سینما ", "بریم شمال، جوج بزنیم با نوشابه", "بریم شهر بازی"],
                ["من با تو تا سر کوچه هم نمی یام" , "بیا بروووو باوو" ]
            ],
        },
        {
            type: "when",
            level : 0,
            models: [
                "کی بریم",
                "کی ؟",
                "چه زمانی برویم"
            ],
            responses: [ 
                [ "همین الان", "یه ساعت دیگه آمادم", "هر وقت دوست داری"],
                ["من با تو تا سر کوچه هم نمی یام" , "بیا بروووو باوو" ]
            ],
        },
    ]
}

const reducer = (state = initialState , action) => {

    let newData = null

    switch(action.type){

        case 'addMessage' :
            return {
                ...state,
                messages : [...state.messages , action.val],
                lastType : action.lastType
            }

        case 'increaseLevel' :
            newData = state.data
            for(let i = 0; i < newData.length; i++){
                if( newData[i].type === action.val.type ){
                    newData[i].level += 1
                    break
                }
            }
            return {
                ...state,
                data : newData
            }

        case 'angery' :
            newData = state.data
            for(let i = 0; i < newData.length; i++){
                newData[i].level = newData[i].responses.length - 1
            }
            return {
                ...state,
                data : newData
            }

        default :
            return state
    }
}

export default reducer
